app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "asdfasdfasdf"], ["created_at", "2024-01-28 17:04:33.035304"], ["updated_at", "2024-01-28 17:04:33.035304"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "asdfasdffffff"], ["updated_at", "2024-01-29 19:39:49.976862"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def delete
    @book = Book.find(params[:id]) #get id from params from url string, find book w that id